{"result":[{"description":"Don't you just love those berries. They come in different flavours, often both sweet and tart. If you want a berry drink just go ahead and try our ABSOLUT Raspiroska. A fresh taste of raspberries. ","languageBranch":"en","id":"berry","name":"Berry"},{"description":"Bitter taste might not always be enjoyed. For some people it is perceived as unplesant, sharp and disagreeable. But in many a drink ingredients with a bitter taste is a lifesaver. Just think what the quinine does for the Gin & Tonic.","languageBranch":"en","id":"bitter","name":"Bitter"},{"description":"Want to indulge in something fresh? Well here you are. The thing about fresh drinks is that they often include fruits like lemon to give a light and refreshing taste. Try the Daiquiri if you want a classic in this category.","languageBranch":"en","id":"fresh","name":"Fresh"},{"description":"To get a real fruity tasting drink you need to add - surprise! - FRUIT. Muddle the fruits to get out the most of it's taste. Common fruity drinks are the tropical beach drinks such as the Pina Colada or the very popular Sex on the Beach.","languageBranch":"en","id":"fruity","name":"Fruity"},{"description":"What taste is herb, you might very well wonder? Well, drinks with flavoured basil, rosemary and thyme goes in this category. A significant drink with a herby taste is for example the Absolut Basil - a sweet marriage between peppar and basil. ","languageBranch":"en","id":"herb","name":"Herb"},{"description":"The sour cocktail was recognized in the mid 19th century and consists of any type of spirit alongside lemon juice and sugar syrup. In some variations it included egg white. This drink is served in an old-fashioned glass filled with ice. Just like the Whiskey Sour.","languageBranch":"en","id":"sour","name":"Sour"},{"description":"Nowdays we see a lot of drinks coming up with ginger and chilli. But of course you'll also find the classic Bloody Mary among these drinks.","languageBranch":"en","id":"spicy","name":"Spicy"},{"description":"It’s not always that you want to travel down the fruity road sometimes you just want to indulge in the spirits itself, thier taste and oily texture. If you want something with that real spirits taste, give it a try with one of the drinks below. ","languageBranch":"en","id":"spirits-palpable","name":"Spirits palpable"},{"description":"Something for the dessert or you just want something that taste like candy? Try the ABSOLUT Chocolate Masked Martini it will definitely fill the cravings for your sweet tooth.","languageBranch":"en","id":"sweet","name":"Sweet"}],"totalResult":9}